import moviex from '../../assets/moviex.png';
import landing from '../../assets/landing.png';
import fitClub from '../../assets/fitClub.png';

export const HindiData = {
    "aboutData": {
        "aboutSectionHeader": "मेरे बारे में",
        "aboutDescText": "मैं 3+ वर्षों के अनुभव वाला एक सॉफ्टवेयर डेवलपर हूँ, जो उत्कृष्ट, आकर्षक और असाधारण डिजिटल अनुभव बनाने (कभी-कभी विकसित करने) में माहिर हूँ। वर्तमान में, मैं सुलभ, मानव-केंद्रित वेब-एप्लिकेशन बनाने पर ध्यान केंद्रित कर रहा हूं, @ ",
        "companyName": "Lowe's India"
    },
    "contactData": {
        "contactSectionHeader": "मुझसे संपर्क करें",
        "thanksMessage": "स्क्रॉल करने के लिए धन्यवाद!",
        "onGoing": {
            "ongoingSectionHeader": "अभी भी विकासाधीन",
            "ongoingfeatures": ["इसे पूरी तरह से अनुकूलित करना (सीधे यूआई से)", "हल्का और अंधेरा थीम दोनों का समर्थन", "इस वेबसाइट को प्रोग्रेसिव वेब ऐप (PWA) में माइग्रेट करना: प्रगति पर"]
        }
    },
    "contactPopup": {
        "contactPopupHeader": "मुझसे संपर्क करें!",
        "labelEmail": "अपना ईमेल दर्ज करें",
        "labelSubject": "विषय",
        "labelMsg": "संदेश",
        "sendBtnText": "भेजें",
        "cancelBtnText": "रद्द करें",
        "successMsg": "सफलता!",
        "failedMsg": "असफल!"
    },
    "experienceSectionData": {
        "experienceHeader": "अनुभव",
        "experienceData": [
            {
                "role": "सॉफ्टवेयर इंजीनियर",
                "companyName": "Lowe's India",
                "company": "lowes",
                "jobLocation": "बैंगलोर, भारत",
                "workYear": "मार्च 2024 - वर्तमान",
                "skillsUsed": ["JavaScript (ES6+)", "React", "Redux", "NodeJs", "Rest-Api", "HTML5", "Css3"],
                "jobRoleDesc": "मैं उत्पाद मालिकों और परियोजना प्रबंधकों के साथ मिलकर काम करता हूँ ताकि आवश्यकताओं को बारीकी से दस्तावेज किया जा सके और हमारे एप्लिकेशन में सुधार किया जा सके। मेरी जिम्मेदारियों में API का एकीकरण, पुन: प्रयोज्य और अनुकूलन योग्य घटकों का विकास और वेब एप्लिकेशन के लिए स्केलेबिलिटी को अनुकूलित करना शामिल है ताकि मजबूत प्रदर्शन सुनिश्चित हो सके। मैं Figma वायर्ड्रेम को कार्यात्मक कोड में परिवर्तित करता हूँ, स्वचालन समाधान लागू करता हूँ और परियोजना की स्थिरता बनाए रखने के लिए व्यापक यूनिट परीक्षण करता हूँ। इसके अतिरिक्त, मैं Confluence पृष्ठों का प्रबंधन करता हूँ ताकि एप्लिकेशन की विशेषताओं और अनुक्रम आरेख को दस्तावेज किया जा सके और परियोजना के लक्ष्यों और परिणामों पर सहमति के लिए हितधारकों के साथ प्रभावशाली चर्चा की सुविधा प्रदान करता हूँ।"
            },
            {
                "role": "वरिष्ठ सॉफ्टवेयर डेवलपर",
                "companyName": "Hexagon R&D India",
                "company": "hexagon",
                "jobLocation": "हैदराबाद, भारत",
                "workYear": "अगस्त 2021 - मार्च 2024",
                "skillsUsed": ["JavaScript (ES6+)", "React", "React-Native", "Redux", "TypeScript", "Rest-Api", "HTML5", "Css3"],
                "jobRoleDesc": "मैं उपयोगकर्ता अनुभव को बेहतर बनाने और विकास प्रक्रियाओं को अनुकूलित करने के लिए समर्पित था ताकि उच्च गुणवत्ता वाले समाधान प्रदान किए जा सकें। मैंने नए फीचर्स को एकीकृत किया, जिनमें API और पुन: प्रयोज्य घटक शामिल हैं, ग्राहक विनिर्देशों के अनुसार, और मजबूत कार्यक्षमता सुनिश्चित करने के लिए कड़े डिबगिंग किया। मेरी कोशिशों ने विभिन्न उपकरणों और प्लेटफार्मों पर एप्लिकेशन की उत्तरदायित्व सुनिश्चित की, React ऑप्टिमाइजेशन तकनीकों का उपयोग करके डेटा हैंडलिंग, कोड दक्षता, API अनुरोध और रेंडरिंग प्रदर्शन में सुधार किया। मैंने कंपनी के लक्ष्यों के साथ मेल खाने के लिए अभिनव समाधान विकसित करने के लिए रचनात्मक समस्या-समाधान और गणितीय कौशल का उपयोग किया। इसके अतिरिक्त, मैंने गुणवत्ता आश्वासन और मेरे विकास टीम के लिए प्रभाव विश्लेषण दस्तावेज (IAD) का प्रबंधन किया, परियोजना के लक्ष्यों के साथ व्यापक मूल्यांकन और संरेखण सुनिश्चित किया।"
            }
        ]
    },
    "heroSectionData": {
        "heroIam": "मैं हूँ",
        "heroName": "संजीव अशोका",
        "techRole": "फ्रंटेंड डेवलपर & React",
        "ifConsultant": true,
        "consultantText": "कंसल्टेंट",
        "contactBtnText": "मुझसे संपर्क करें"
    },
    "portfolioSectionData": {
        "portfolioSectionHeader": "पोर्टफोलियो",
        "visitBtnText": "वेबसाइट",
        "gitBtnText": "GitRepo",
        "portfolioCardsData": [
            {
                "projectName": "Movix वेबसाइट",
                "projectDesc": "Disney+HotStar जैसी ऑनलाइन OTT प्लेटफॉर्म...",
                "imageSrc": moviex,
                "imageAlt": "Moviex",
                "gitRepoName": "Moviex",
                "projectWebsite": "https://moviex-nine-mocha.vercel.app/"
            },
            {
                "projectName": "लैंडिंग पेज",
                "projectDesc": "फोटोग्राफी एजेंसी के लिए एक उत्तरदायी लैंडिंग पेज...",
                "imageSrc": landing,
                "imageAlt": "लैंडिंग पेज",
                "gitRepoName": "Responsive_Landing_Page",
                "projectWebsite": "https://sanjeevashoka.github.io/Responsive_Landing_Page/"
            },
            {
                "projectName": "FitClub वेबसाइट",
                "projectDesc": "एक उत्तरदायी जिम वेबसाइट जिसमें जिम की सेवाओं, ऑफ़रों की जानकारी...",
                "imageSrc": fitClub,
                "imageAlt": "FitClub जिम",
                "gitRepoName": "fit_Club_Website",
                "projectWebsite": "https://fitclubgym-6jk.pages.dev/"
            }
        ]
    },
    "resumeSectionData": {
        "resumeHaveLookText": "मेरा",
        "resumetext": "शानदार रिज़्यूमे",
        "downloadBtnText": "डाउनलोड"
    },
    "skillSectionData": {
        "skillSectionHeader": "मेरे कौशल"
    },
    "navSectionData":{
        navOptions: ["संबंधित", "पोर्टफोलियो", "अनुभव", "संपर्क"],
        languageOptions:[
            {languageText: 'En', flag: '🇬🇧'},
            {languageText: 'Fr', flag: '🇫🇷'},
            {languageText: 'Pl', flag: '🇵🇱'},
            {languageText: 'अ', flag: '🇮🇳'},
            {languageText: '中', flag: '🇨🇳'},
        ]
    }
}
